{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}}, "outputs": {"dense": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/SpaceToBatchND/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/BatchToSpaceND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/SpaceToBatchND/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/BatchToSpaceND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/SpaceToBatchND/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/BatchToSpaceND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/SpaceToBatchND/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/BatchToSpaceND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_6/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_7/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/global_average_pooling2d/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_6/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_6/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d/Relu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/activation/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential/conv2d/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/activation/Relu", "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/activation_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3", "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/activation_1/Relu", "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3", "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/SpaceToBatchND/block_shape", "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/SpaceToBatchND/paddings"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential/conv2d_2/Conv2D/SpaceToBatchND", "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["StatefulPartitionedCall/sequential/conv2d_2/Conv2D", "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/BatchToSpaceND/block_shape", "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/BatchToSpaceND/crops"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential/conv2d_2/Conv2D/BatchToSpaceND", "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/activation_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential/conv2d_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/activation_2/Relu", "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3", "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/SpaceToBatchND/block_shape", "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/SpaceToBatchND/paddings"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential/conv2d_3/Conv2D/SpaceToBatchND", "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["StatefulPartitionedCall/sequential/conv2d_3/Conv2D", "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/BatchToSpaceND/block_shape", "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/BatchToSpaceND/crops"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential/conv2d_3/Conv2D/BatchToSpaceND", "StatefulPartitionedCall/sequential/conv2d_3/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/activation_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential/conv2d_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/activation_3/Relu", "StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3", "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/SpaceToBatchND/block_shape", "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/SpaceToBatchND/paddings"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential/conv2d_4/Conv2D/SpaceToBatchND", "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["StatefulPartitionedCall/sequential/conv2d_4/Conv2D", "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/BatchToSpaceND/block_shape", "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/BatchToSpaceND/crops"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential/conv2d_4/Conv2D/BatchToSpaceND", "StatefulPartitionedCall/sequential/conv2d_4/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/activation_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential/conv2d_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/activation_4/Relu", "StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3", "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/SpaceToBatchND/block_shape", "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/SpaceToBatchND/paddings"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential/conv2d_5/Conv2D/SpaceToBatchND", "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["StatefulPartitionedCall/sequential/conv2d_5/Conv2D", "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/BatchToSpaceND/block_shape", "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/BatchToSpaceND/crops"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential/conv2d_5/Conv2D/BatchToSpaceND", "StatefulPartitionedCall/sequential/conv2d_5/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/activation_5/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential/conv2d_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/activation_5/Relu", "StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/activation_6/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3", "StatefulPartitionedCall/sequential/conv2d_6/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential/conv2d_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_6/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/activation_6/Relu", "StatefulPartitionedCall/sequential/batch_normalization_6/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_6/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential/batch_normalization_6/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential/batch_normalization_6/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_7/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/batch_normalization_6/FusedBatchNormV3", "StatefulPartitionedCall/sequential/conv2d_7/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential/conv2d_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/global_average_pooling2d/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential/conv2d_7/BiasAdd", "StatefulPartitionedCall/sequential/global_average_pooling2d/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/global_average_pooling2d/Mean", "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/dense/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp", "shape": [3, 3, 3, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/SpaceToBatchND/block_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/SpaceToBatchND/paddings", "shape": [2, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/BatchToSpaceND/block_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/BatchToSpaceND/crops", "shape": [2, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/SpaceToBatchND/block_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/SpaceToBatchND/paddings", "shape": [2, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/BatchToSpaceND/block_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/Conv2D/BatchToSpaceND/crops", "shape": [2, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_3/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/SpaceToBatchND/block_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/SpaceToBatchND/paddings", "shape": [2, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/BatchToSpaceND/block_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/Conv2D/BatchToSpaceND/crops", "shape": [2, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_4/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/SpaceToBatchND/block_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/SpaceToBatchND/paddings", "shape": [2, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/BatchToSpaceND/block_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/Conv2D/BatchToSpaceND/crops", "shape": [2, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_5/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_6/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_6/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_7/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_7/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/global_average_pooling2d/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "shape": [64, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_6/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_6/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}]}]}